---
kind: property
id: P:Autodesk.Revit.DB.Analysis.EnergyDataSettings.BuildingTypeId
source: html/b20ad078-bbc6-3c0a-84eb-f4414af6e5d7.htm
---
# Autodesk.Revit.DB.Analysis.EnergyDataSettings.BuildingTypeId Property

The building type element.

## Syntax (C#)
```csharp
public ElementId BuildingTypeId { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - When setting this property: A non-optional argument was null